mcintosh/dTinyG2/src/motate/STM32_F4xx/STMF4Pins.h
/*
 utility/SamPins.h - Library for the Motate system
 http://github.com/synthetos/motate/

 Copyright (c) 2015 - 2016 Robert Giseburt

	This file is part of the Motate Library.

	This file ("the software") is free software: you can redistribute it and/or modify
	it under the terms of the GNU General Public License, version 2 as published by the
	Free Software Foundation. You should have received a copy of the GNU General Public
	License, version 2 along with the software. If not, see <http://www.gnu.org/licenses/>.

	As a special exception, you may use this file as part of a software library without
	restriction. Specifically, if other files instantiate templates or use macros or
	inline functions from this file, or you compile this file and link it with  other
	files to produce an executable, this file does not by itself cause the resulting
	executable to be covered by the GNU General Public License. This exception does not
	however invalidate any other reasons why the executable file might be covered by the
	GNU General Public License.

	THE SOFTWARE IS DISTRIBUTED IN THE HOPE THAT IT WILL BE USEFUL, BUT WITHOUT ANY
	WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
	OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT
	SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
	LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF
	OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

 */

#ifndef SAMPINS_H_ONCE
#define SAMPINS_H_ONCE

// #include <chip.h>
#include <stm32f4xx.h>
#include "stm32f4xx_hal.h"
#include "MotateTimers.h"

#include <functional>
#include <type_traits>
#include <string.h>

namespace Motate {
// Numbering is arbitrary:
enum PinMode : PinMode_t {
			kUnchanged      = 0,
			kOutput         = 1, // Output PP
			kInput          = 2,
			kOutputOD       = 3,	// Output OD
			kAnalog         = 4,	// Analog
			kOutputPWM      = 5, // Output PP
};

// Numbering is arbitrary, but bit unique for bitwise operations (unlike other architectures):
enum PinOptions : PinOptions_t {
	kNormal         = 0,
			kPullUp         = 1<<1,

			kDeglitch       = 1<<4,
			kDebounce       = 1<<5,

			// Set the intialized value of the pin
			kStartHigh      = 1<<6,
			kStartLow       = 1<<7,
			// For use on PWM pins only!
			kPWMPinInverted = 1<<8,
};

enum PinInterruptOptions : PinInterruptOptions_t {
	kPinInterruptsOff                = 0,

			kPinInterruptOnChange            = 1,

			kPinInterruptOnRisingEdge        = 1<<1,
			kPinInterruptOnFallingEdge       = 2<<1,

			kPinInterruptOnLowLevel          = 3<<1,
			kPinInterruptOnHighLevel         = 4<<1,

			kPinInterruptAdvancedMask        = ((1<<3)-1)<<1,

			/* This turns the IRQ on, but doesn't set the timer to ever trigger it. */
			kPinInterruptOnSoftwareTrigger   = 1<<4,

			kPinInterruptTypeMask            = (1<<5)-1,

			/* Set priority levels here as well: */
			kPinInterruptPriorityHighest     = 1<<5,
			kPinInterruptPriorityHigh        = 1<<6,
			kPinInterruptPriorityMedium      = 1<<7,
			kPinInterruptPriorityLow         = 1<<8,
			kPinInterruptPriorityLowest      = 1<<9,

			kPinInterruptPriorityMask        = ((1<<10) - (1<<5))
};

struct _pinChangeInterrupt {
	const uint32_t pc_mask; // Pin uses "mask" so we use a different name. "pc" for pinChange
	std::function<void(void)> interrupt_handler;
	_pinChangeInterrupt *next;

	_pinChangeInterrupt(const _pinChangeInterrupt &) = delete; // delete the copy constructor, we only allow moves
	_pinChangeInterrupt &operator=(const _pinChangeInterrupt &) = delete; // delete the assigment operator, we only allow moves
	_pinChangeInterrupt &operator=(const _pinChangeInterrupt &&) = delete; // delete the move assigment operator, we only allow moves


	_pinChangeInterrupt(const uint32_t _mask, std::function<void(void)> &&_interrupt, _pinChangeInterrupt *&_first)
	: pc_mask{_mask}, interrupt_handler{std::move(_interrupt)}, next{nullptr}
	{
		if (interrupt_handler) { // std::function returns false if the function isn't valid
			if (_first == nullptr) {
				_first = this;
				return;
			}

			_pinChangeInterrupt *i = _first;
			while (i->next != nullptr) {
				i = i->next;
			}
			i->next = this;
		}
	};

	void setInterrupt(std::function<void(void)> &&_interrupt)
	{
		interrupt_handler = std::move(_interrupt);
	};

	void setInterrupt(const std::function<void(void)> &_interrupt)
	{
		interrupt_handler = _interrupt;
	};
};

typedef uint32_t uintPort_t;

//#pragma mark PortHardware
/**************************************************
 *
 * HARDWARE LAYER: PortHardware
 *
 **************************************************/

template <unsigned char portLetter>
struct PortHardware {
	static const uint8_t letter = portLetter;
	static uint32_t _inverted;

	// The constexpr functions we can define here, and get really great optimization.
	// These switch statements are handled by the compiler, not at runtime.
	constexpr GPIO_TypeDef* const rawPort() const
	{
		switch (portLetter) {
		case 'A': return GPIOA;
#ifdef GPIOB
		case 'B': return GPIOB;
#endif
#ifdef GPIOC
		case 'C': return GPIOC;
#endif
#ifdef GPIOD
		case 'D': return GPIOD;
#endif
#ifdef GPIOF
		case 'F': return GPIOF;
#endif
		}
	};
	constexpr IRQn_Type _IRQn(const uintPort_t mask){
		switch (mask) {
			case GPIO_PIN_0:
				return EXTI0_IRQn;
			case GPIO_PIN_1:
				return EXTI1_IRQn;
			case GPIO_PIN_2:
				return EXTI2_IRQn;
			case GPIO_PIN_3:
				return EXTI3_IRQn;
			case GPIO_PIN_4:
				return EXTI4_IRQn;
			case GPIO_PIN_5:
			case GPIO_PIN_6:
			case GPIO_PIN_7:
			case GPIO_PIN_8:
			case GPIO_PIN_9:
				return EXTI9_5_IRQn;
			case GPIO_PIN_10:
			case GPIO_PIN_11:
			case GPIO_PIN_12:
			case GPIO_PIN_13:
			case GPIO_PIN_14:
			case GPIO_PIN_15:
				return EXTI15_10_IRQn;
			default:
				return EXTI0_IRQn;
		}

	}
	constexpr static const uint32_t peripheralId()
	{
		switch (portLetter) {
		default:
		case 'A': return 0;
#ifdef GPIOB
		case 'B': return 1;
#endif
#ifdef GPIOC
		case 'C': return 2;
#endif
#ifdef GPIOD
		case 'D': return 3;
#endif
#ifdef GPIOF
		case 'F': return 5;
#endif
		}
	};



	static _pinChangeInterrupt *_firstInterrupt;

	void enableClock();
	void setModes(const PinMode type, const uintPort_t mask) {
		// Configure GPIO
		GPIO_InitTypeDef GPIO_InitStructure;

		enableClock();


		GPIO_InitStructure.Pin       = mask;

		GPIO_InitStructure.Pull      = GPIO_NOPULL;
		GPIO_InitStructure.Speed     = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Alternate = 0;

		switch (type) {
		case kOutput:
			GPIO_InitStructure.Mode      = GPIO_MODE_OUTPUT_PP;
			HAL_GPIO_Init(rawPort(), &GPIO_InitStructure);
			break;
		case kOutputOD:
			GPIO_InitStructure.Mode      = GPIO_MODE_OUTPUT_OD;
			HAL_GPIO_Init(rawPort(), &GPIO_InitStructure);
			break;
		case kInput:
			GPIO_InitStructure.Mode      = GPIO_MODE_INPUT;
			HAL_GPIO_Init(rawPort(), &GPIO_InitStructure);
			break;
		case kAnalog:
			GPIO_InitStructure.Mode      = GPIO_MODE_ANALOG;
			HAL_GPIO_Init(rawPort(), &GPIO_InitStructure);
			break;
		case kOutputPWM:
			GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
			GPIO_InitStructure.Pull      = GPIO_PULLDOWN;
			GPIO_InitStructure.Speed     = GPIO_SPEED_FREQ_LOW;
			GPIO_InitStructure.Alternate = GPIO_AF3_TIM8;
			HAL_GPIO_Init(rawPort(), &GPIO_InitStructure);
			break;
		default:
			break;
		}


