mcintosh/dTinyG2/src/motate/STM32_F4xx/STMF4Pins.h
	};
	// Returns the mode of ONE pin, and only Input or Output
	PinMode getMode(const uintPort_t mask) {
		uint32_t pin_index = 0;
		for (int i=1, iter=0; iter<32; i<<=1, iter++){
			if (mask & i){
				pin_index = iter;
				break;
			}
		}

		return (rawPort()->MODER & (GPIO_MODER_MODER0 << (pin_index * 2))) ? kOutput : kInput;
	};
	void setOptions(const PinOptions_t options, const uintPort_t mask) {
		uint32_t pin_index = 0;
		for (int i=1, iter=0; iter<32; i<<=1, iter++){
			if (mask & i){
				pin_index = iter;
				break;
			}
		}

		if(kPWMPinInverted & options)
		{
			_inverted |= mask;
		}
		if (kStartHigh & options)
		{
			set(mask);
		} else if (kStartLow & options)
		{
			clear(mask);
		}
		if (kPullUp & options)
		{
			rawPort()->PUPDR &= (uint32_t)(~(GPIO_PUPDR_PUPDR0 << (pin_index * 2)));
			rawPort()->PUPDR |= (uint32_t)(GPIO_PULLUP << (pin_index * 2));
		}
		else
		{
			rawPort()->PUPDR &= (uint32_t)(~(GPIO_PUPDR_PUPDR0 << (pin_index * 2)));
		}
	};
	PinOptions_t getOptions(const uintPort_t mask) {
		/*            return ((//rawPort()->PIO_PUSR & mask) ? kPullUp : 0) |
            ((//rawPort()->PIO_MDSR & mask) ? kWiredAnd : 0) |
            ((//rawPort()->PIO_IFSR & mask) ?
             ((//rawPort()->PIO_IFDGSR & mask) ? kDebounce : kDeglitch) : 0);
		 */
		return 0;
	};
	void set(const uintPort_t mask) {
		if(_inverted & mask)
			rawPort()->BSRR = (uint32_t)(mask << 16) ;
		else
			rawPort()->BSRR = mask;
	};
	void clear(const uintPort_t mask) {
		if(_inverted & mask)
			rawPort()->BSRR = mask;
		else
			rawPort()->BSRR = (uint32_t)(mask << 16) ;
	};
	void toggle(const uintPort_t mask) {
		rawPort()->ODR ^= mask;
	};
	void write(const uintPort_t value) {
		rawPort()->ODR = value & 0xFFFF;
	};
	void write(const uintPort_t value, const uintPort_t mask) {
		rawPort()->ODR = value & mask;
	};
	uintPort_t getInputValues(const uintPort_t mask) {
		return rawPort()->IDR  & mask;
	};
	uintPort_t getOutputValues(const uintPort_t mask) {
		return rawPort()->ODR  & mask;
	};
	GPIO_TypeDef* portPtr() {
		return rawPort;
	};
	void setInterrupts(const uint32_t interrupts, const uintPort_t mask) {
		if (interrupts != kPinInterruptsOff) {
			GPIO_InitTypeDef GPIO_InitStructure;

			enableClock();


			GPIO_InitStructure.Pin       = mask;

			GPIO_InitStructure.Pull      = GPIO_NOPULL;
			GPIO_InitStructure.Speed     = GPIO_SPEED_HIGH;
			GPIO_InitStructure.Alternate = 0;
			//rawPort()->PIO_IDR = mask;

			/*Is it an "advanced" interrupt?*/
			if (interrupts & kPinInterruptAdvancedMask) {
				/*Is it an edge interrupt?*/
				if ((interrupts & kPinInterruptTypeMask) == kPinInterruptOnRisingEdge ||
						(interrupts & kPinInterruptTypeMask) == kPinInterruptOnFallingEdge) {

					if((interrupts & kPinInterruptTypeMask) == kPinInterruptOnRisingEdge){
						GPIO_InitStructure.Mode = GPIO_MODE_IT_RISING;
					}else{
						GPIO_InitStructure.Mode = GPIO_MODE_IT_FALLING;
					}
				}
			}
			else
			{
				// kPinInterruptOnChange
				GPIO_InitStructure.Mode = GPIO_MODE_IT_RISING_FALLING;

			}
			HAL_GPIO_Init(rawPort(), &GPIO_InitStructure);

			/* Set interrupt priority */
			if (interrupts & kPinInterruptPriorityMask) {
				if (interrupts & kPinInterruptPriorityHighest) {
					NVIC_SetPriority(_IRQn(mask), 0);
				}
				else if (interrupts & kPinInterruptPriorityHigh) {
					NVIC_SetPriority(_IRQn(mask), 3);
				}
				else if (interrupts & kPinInterruptPriorityMedium) {
					NVIC_SetPriority(_IRQn(mask), 7);
				}
				else if (interrupts & kPinInterruptPriorityLow) {
					NVIC_SetPriority(_IRQn(mask), 11);
				}
				else if (interrupts & kPinInterruptPriorityLowest) {
					NVIC_SetPriority(_IRQn(mask), 15);
				}
			}
			/* Enable the IRQ */
			NVIC_EnableIRQ(_IRQn(mask));
			/* Enable the interrupt */
			//rawPort()->PIO_IER = mask;
		} else {
			//rawPort()->PIO_IDR = mask;
			//if (0)//rawPort()->PIO_ISR == 0)
			NVIC_DisableIRQ(_IRQn(mask));
		}
	};

	void addInterrupt(_pinChangeInterrupt *newInt) {
		_pinChangeInterrupt *i = _firstInterrupt;
		if (i == nullptr) {
			_firstInterrupt = newInt;
			return;
		}
		while (i->next != nullptr) {
			i = i->next;
		}
		i->next = newInt;
	}
};

/**************************************************
 *
 * BASIC PINS: _MAKE_MOTATE_PIN
 *
 **************************************************/

#define ___MAKE_MOTATE_PIN(pinNum, registerChar, registerPin)

#define _MAKE_MOTATE_PIN(pinNum, registerChar, registerPin) \
template<> \
struct Pin<pinNum> : RealPin<registerChar, registerPin> { \
	static const int16_t number = pinNum; \
	static const uint8_t portLetter = (uint8_t) registerChar; \
	Pin() : RealPin<registerChar, registerPin>() {}; \
	Pin(const PinMode type, const PinOptions_t options = kNormal) : RealPin<registerChar, registerPin>(type, options) {}; \
}; \
template<> \
struct ReversePinLookup<registerChar, registerPin> : Pin<pinNum> { \
	ReversePinLookup() {}; \
	ReversePinLookup(const PinMode type, const PinOptions_t options = kNormal) : Pin<pinNum>(type, options) {}; \
};




//#pragma mark IRQPin support
/**************************************************
 *
 * PIN CHANGE INTERRUPT SUPPORT: IsIRQPin / MOTATE_PIN_INTERRUPT
 *
 **************************************************/

template<int16_t pinNum>
constexpr const bool IsIRQPin() { return !Pin<pinNum>::isNull(); }; // Basically return if we have a valid pin.

#define MOTATE_PIN_INTERRUPT(number) \
		template<> void Motate::IRQPin<number>::interrupt()





//#pragma mark ADC_Module/ACD_Pin (Sam3x)
/**************************************************
 *
 * PIN CHANGE INTERRUPT SUPPORT: IsIRQPin / MOTATE_PIN_INTERRUPT
 *
 **************************************************/
// Internal ADC object, and a parent of the ADCPin objects.
    // Handles: Setting options for the ADC module as a whole,
    //          and initializing the ADC module once. Initialized
    struct ADC_Module {
        static const uint32_t default_adc_clock_frequency = 20000000;
        static const uint32_t default_adc_startup_time = 12;
        static const uint32_t peripheralId() { return (uint32_t)1; }
        static ADC_HandleTypeDef    AdcHandle;
        static uint32_t	uhADCxConvertedValue[16];
        static uint8_t	rankToChannel[16];
        static uint32_t numInitialized;


        static bool inited_;

        void init(const uint32_t adc_clock_frequency, const uint8_t adc_startuptime) {
            if (!inited_) {
            	memset(uhADCxConvertedValue, 0, sizeof(uhADCxConvertedValue));
            	memset(rankToChannel, 0xFF, sizeof(rankToChannel));
            }

            inited_ = true;
            numInitialized++;

            AdcHandle.Instance          		 = ADC1;
            AdcHandle.Init.ClockPrescaler        = ADC_CLOCKPRESCALER_PCLK_DIV8;
            AdcHandle.Init.Resolution            = ADC_RESOLUTION12b;
            AdcHandle.Init.ScanConvMode          = ENABLE;                       /* Sequencer disabled (ADC conversion on only 1 channel: channel set on rank 1) */
            AdcHandle.Init.ContinuousConvMode    = ENABLE;                        /* Continuous mode disabled to have only 1 conversion at each conversion trig */
            AdcHandle.Init.DiscontinuousConvMode = DISABLE;                       /* Parameter discarded because sequencer is disabled */
            AdcHandle.Init.NbrOfDiscConversion   = 0;
            AdcHandle.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;        /* Conversion start trigged at each external event */
            AdcHandle.Init.ExternalTrigConv      = ADC_EXTERNALTRIGCONV_T1_CC1;
            AdcHandle.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
            AdcHandle.Init.NbrOfConversion       = numInitialized;
            AdcHandle.Init.DMAContinuousRequests = ENABLE;
            AdcHandle.Init.EOCSelection          = DISABLE;

            if (HAL_ADC_Init(&AdcHandle) != HAL_OK)
            {
              /* ADC initialization Error */
              while(1){};//Error_Handler();
            }

