mcintosh/dTinyG2/src/motate/STM32_F4xx/STMF4Pins.h
        };

        ADC_Module() {
            init(default_adc_clock_frequency, default_adc_startup_time);
        };

        static void startSampling() {
			  /*##-3- Start the conversion process #######################################*/
			  /* Note: Considering IT occurring after each number of ADC conversions      */
			  /*       (IT by DMA end of transfer), select sampling time and ADC clock    */
			  /*       with sufficient duration to not create an overhead situation in    */
			  /*        IRQHandler. */
			  if(HAL_ADC_Start_DMA(&AdcHandle, (uint32_t*)&uhADCxConvertedValue, numInitialized) != HAL_OK)
			  {
			    /* Start Conversation Error */
				  while(1);//Error_Handler();
			  }
        };

        static void startFreeRunning() {
            //ADC->ADC_MR |= ADC_MR_FREERUN_ON;
        };
    };

    template<pin_number pinNum>
    struct ADCPinParent {
        static const uint32_t adcMask = 0;
        static const uint32_t adcNumber = 0;
        static const uint16_t getTop() { return 4095; };
    };

    template<pin_number pinNum>
    struct ADCPin : ADCPinParent<pinNum>, Pin<pinNum>, ADC_Module
    {
        using ADCPinParent<pinNum>::adcMask;
        using ADCPinParent<pinNum>::adcNumber;
        using ADCPinParent<pinNum>::getTop;
        using ADC_Module::numInitialized;

        ADCPin() : ADCPinParent<pinNum>(), Pin<pinNum>(kAnalog), ADC_Module() { init(); };
        ADCPin(const PinOptions_t options) : ADCPinParent<pinNum>(), Pin<pinNum>(kAnalog), ADC_Module() { init(options); };

        void init(const PinOptions_t options = kNormal) {
            /* Enable the pin */
        	Pin<pinNum>::init(kAnalog, options);
        };
        uint32_t getRaw() {
        	if(rankToChannel[adcNumber] < numInitialized)
        		return uhADCxConvertedValue[rankToChannel[adcNumber]];
        	else
        		return 0;
        };
        uint32_t getValue() {
            //if ((ADC->ADC_CHSR & adcMask) != adcMask) {
            //    ADC->ADC_CR = ADC_CR_START; /* start the sample */
            //    while ((ADC->ADC_ISR & ADC_ISR_DRDY) != ADC_ISR_DRDY) {;} /* Wait... */
            //}
            return getRaw();
        };
        operator int16_t() {
            return getValue();
        };
        operator float() {
            return (float)getValue() / getTop();
        };
        static const bool is_real = true;
        void setInterrupts(const uint32_t interrupts) {
        	ADC_ChannelConfTypeDef sConfig;

            if (interrupts != kPinInterruptsOff)
            {
                /* Set interrupt priority */
                if (interrupts & kPinInterruptPriorityMask) {
                    if (interrupts & kPinInterruptPriorityHighest) {
                        NVIC_SetPriority(DMA2_Stream0_IRQn, 0);
                    }
                    else if (interrupts & kPinInterruptPriorityHigh) {
                        NVIC_SetPriority(DMA2_Stream0_IRQn, 3);
                    }
                    else if (interrupts & kPinInterruptPriorityMedium) {
                        NVIC_SetPriority(DMA2_Stream0_IRQn, 7);
                    }
                    else if (interrupts & kPinInterruptPriorityLow) {
                        NVIC_SetPriority(DMA2_Stream0_IRQn, 11);
                    }
                    else if (interrupts & kPinInterruptPriorityLowest) {
                        NVIC_SetPriority(DMA2_Stream0_IRQn, 15);
                    }
                }
                /* Enable the IRQ */
                NVIC_EnableIRQ(DMA2_Stream0_IRQn);

                rankToChannel[adcNumber] = numInitialized-1;
				sConfig.Channel      = adcNumber;
				sConfig.Rank         = numInitialized;
				sConfig.SamplingTime = ADC_SAMPLETIME_56CYCLES;
				sConfig.Offset       = 0;
				if (HAL_ADC_ConfigChannel(&AdcHandle, &sConfig) != HAL_OK)
				{
					/* Channel Configuration Error */
					while(1);//Error_Handler();
				}




            } else {
                /* Disable the pin */
                //ADC->ADC_CHDR = adcMask;
                /* Disable the interrupt */
                //ADC->ADC_IDR = adcMask;
                /* Disable the interrupt - if all channels are disabled */
                //if (ADC->ADC_CHSR == 0) {
                //    NVIC_DisableIRQ(ADC_IRQn);
                //}
            }
        };
        static void interrupt();
    };

    template<int16_t adcNum>
    struct ReverseADCPin : ADCPin<-1> {
        ReverseADCPin() : ADCPin<-1>() {};
        ReverseADCPin(const PinOptions_t options) : ADCPin<-1>() {};
    };

#define _MAKE_MOTATE_ADC_PIN(registerChar, registerPin, adcNum) \
    template<> \
    struct ADCPinParent< ReversePinLookup<registerChar, registerPin>::number > { \
        static const uint32_t adcMask = 1 << adcNum; \
        static const uint32_t adcNumber = adcNum; \
        static const uint16_t getTop() { return 4095; }; \
    }; \
    template<> \
    struct ReverseADCPin<adcNum> : ADCPin<ReversePinLookup<registerChar, registerPin>::number> { \
        ReverseADCPin() : ADCPin<ReversePinLookup<registerChar, registerPin>::number>() {}; \
        ReverseADCPin(const PinOptions_t options) : ADCPin<ReversePinLookup<registerChar, registerPin>::number>(options) {}; \
    };

    template<int16_t pinNum>
    constexpr const bool IsADCPin() { return ADCPin<pinNum>::is_real; };

    template<uint8_t portChar, int16_t portPin>
    using LookupADCPin = ADCPin< ReversePinLookup<portChar, portPin>::number >;

    template<int16_t adcNum>
    using LookupADCPinByADC = ADCPin< ReverseADCPin< adcNum >::number >;

//#pragma mark PWMOutputPin support
/**************************************************
 *
 * PWM ("fake" analog) output pin support: _MAKE_MOTATE_PWM_PIN
 *
 **************************************************/

#define _MAKE_MOTATE_PWM_PIN(registerChar, registerPin, timerOrPWM, invertedByDefault) \
		template<> \
		struct AvailablePWMOutputPin< ReversePinLookup<registerChar, registerPin>::number > : RealPWMOutputPin< ReversePinLookup<registerChar, registerPin>::number, timerOrPWM> { \
	typedef timerOrPWM parentTimerType; \
	static const pin_number pinNum = ReversePinLookup<registerChar, registerPin>::number; \
	AvailablePWMOutputPin() : RealPWMOutputPin<pinNum, timerOrPWM>(kOutput) { pwmpin_init(invertedByDefault ? kPWMOnInverted : kPWMOn);}; \
	AvailablePWMOutputPin(const PinOptions_t options, const uint32_t freq) : RealPWMOutputPin<pinNum, timerOrPWM>(kOutput, options, freq) { \
		pwmpin_init((invertedByDefault ^ ((options & kPWMPinInverted)?true:false)) ? kPWMOnInverted : kPWMOn); \
	}; \
	using RealPWMOutputPin<pinNum, timerOrPWM>::operator=; \
	/* Signal to _GetAvailablePWMOrAlike that we're here, AND a real Pin<> exists. */ \
		static constexpr bool _isAvailable() { return !ReversePinLookup<registerChar, registerPin>::isNull(); };  \
};


//#pragma mark SPI Pins support
/**************************************************
 *
 * SPI PIN METADATA and wiring: specializes SPIChipSelectPin / SPIMISOPin / SPIMOSIPin / SPISCKPin
 *
 * Provides: _MAKE_MOTATE_SPI_CS_PIN
 *           _MAKE_MOTATE_SPI_MISO_PIN
 *           _MAKE_MOTATE_SPI_MOSI_PIN
 *           _MAKE_MOTATE_SPI_SCK_PIN
 *
 **************************************************/


#define _MAKE_MOTATE_SPI_CS_PIN(registerChar, registerPin, spiNumber, peripheralAorB, csNum) \
		template<> \
		struct SPIChipSelectPin< ReversePinLookup<registerChar, registerPin>::number > : ReversePinLookup<registerChar, registerPin> { \
	SPIChipSelectPin() : ReversePinLookup<registerChar, registerPin>(kPeripheral ## peripheralAorB) {}; \
	static constexpr bool is_real = true; \
	static constexpr uint8_t spiNum = spiNumber; \
	static constexpr uint8_t csNumber =  csNum; \
	static constexpr uint8_t csValue  = ~csNum; \
	static constexpr bool usesDecoder = false; \
};

#define _MAKE_MOTATE_SPI_MISO_PIN(registerChar, registerPin, spiNumber, peripheralAorB)\
		template<>\
		struct SPIMISOPin< ReversePinLookup<registerChar, registerPin>::number > : ReversePinLookup<registerChar, registerPin> {\
	SPIMISOPin() : ReversePinLookup<registerChar, registerPin>{kPeripheral ## peripheralAorB} {};\
	static constexpr bool is_real = true; \
	static constexpr uint8_t spiNum = spiNumber; \
};


#define _MAKE_MOTATE_SPI_MOSI_PIN(registerChar, registerPin, spiNumber, peripheralAorB)\
		template<>\
		struct SPIMOSIPin< ReversePinLookup<registerChar, registerPin>::number > : ReversePinLookup<registerChar, registerPin> {\
	SPIMOSIPin() : ReversePinLookup<registerChar, registerPin>{kPeripheral ## peripheralAorB} {};\
	static constexpr bool is_real = true; \
	static constexpr uint8_t spiNum = spiNumber; \
};


#define _MAKE_MOTATE_SPI_SCK_PIN(registerChar, registerPin, spiNumber, peripheralAorB)\
		template<>\
		struct SPISCKPin< ReversePinLookup<registerChar, registerPin>::number > : ReversePinLookup<registerChar, registerPin> {\
	SPISCKPin() : ReversePinLookup<registerChar, registerPin> { kPeripheral ## peripheralAorB } {};\
	static constexpr bool is_real = true; \
	static constexpr uint8_t spiNum = spiNumber; \
};


//#pragma mark UART / USART Pin support
/**************************************************
 *
 * UART/USART PIN METADATA and wiring: specializes UARTTxPin / UARTRxPin / UARTRTSPin / UARTCTSPin
 *
 * Provides: _MAKE_MOTATE_UART_TX_PIN
 *           _MAKE_MOTATE_UART_RX_PIN
 *           _MAKE_MOTATE_UART_RTS_PIN
 *           _MAKE_MOTATE_UART_CTS_PIN
 *
 **************************************************/

